SmoothTechnology/ArduinoCore-samd/boards.txt
# Copyright (c) 2014-2015 Arduino LLC.  All right reserved.
#
# This library is free software; you can redistribute it and/or
# modify it under the terms of the GNU Lesser General Public
# License as published by the Free Software Foundation; either
# version 2.1 of the License, or (at your option) any later version.
#
# This library is distributed in the hope that it will be useful,
# but WITHOUT ANY WARRANTY; without even the implied warranty of
# MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.
# See the GNU Lesser General Public License for more details.
#
# You should have received a copy of the GNU Lesser General Public
# License along with this library; if not, write to the Free Software
# Foundation, Inc., 51 Franklin St, Fifth Floor, Boston, MA  02110-1301  USA

menu.cache=Cache

# POE Playground
# ------------------------------
smooth_playground.name=Smooth POE Playground
smooth_playground.vid.0=0x239A
smooth_playground.pid.0=0x8020
smooth_playground.vid.1=0x239A
smooth_playground.pid.1=0x0020
smooth_playground.upload.tool=bossac18
smooth_playground.upload.protocol=sam-ba
smooth_playground.upload.maximum_size=507904
smooth_playground.upload.offset=0x8000
smooth_playground.upload.use_1200bps_touch=true
smooth_playground.upload.wait_for_upload_port=true
smooth_playground.upload.native_usb=true
smooth_playground.build.mcu=cortex-m4
smooth_playground.build.f_cpu=120000000L
smooth_playground.build.usb_product="Smooth POE Playground"
smooth_playground.build.usb_manufacturer="Smooth"
smooth_playground.build.board=METRO_M4
smooth_playground.build.core=arduino
smooth_playground.build.extra_flags=-D__SAMD51J19A__ -DADAFRUIT_METRO_M4_EXPRESS -D__SAMD51__ {build.usb_flags} -D__FPU_PRESENT -DARM_MATH_CM4 -mfloat-abi=hard -mfpu=fpv4-sp-d16
smooth_playground.build.ldscript=linker_scripts/gcc/flash_with_bootloader.ld
smooth_playground.build.openocdscript=openocd_scripts/arduino_zero.cfg
smooth_playground.build.variant=poe_playground
smooth_playground.build.variant_system_lib=
smooth_playground.build.vid=0x239A
smooth_playground.build.pid=0x8020
smooth_playground.bootloader.tool=openocd
smooth_playground.bootloader.file=metroM4/bootloader-metro_m4-v2.0.0-adafruit.5.bin
smooth_playground.compiler.arm.cmsis.ldflags="-L{build.variant.path}" -larm_cortexM4lf_math -mfloat-abi=hard -mfpu=fpv4-sp-d16
smooth_playground.menu.cache.on=Enabled
smooth_playground.menu.cache.on.build.cache_flags=-DENABLE_CACHE
smooth_playground.menu.cache.off=Disabled
smooth_playground.menu.cache.off.build.cache_flags=
